categories = {
    # ЖЕНЩИНЫ
    "ж": {
        "25м": {
            "50м в/с": {"МС": 25.95, "КМС": 26.75, "I": 28.05, "II": 30.75, "III": 32.75,
                        "I(ю)": 39.75, "II(ю)": 49.75, "III(ю)": 59.25},
            "100м в/с": {"МС": 56.40, "КМС": 60.40, "I": 64.24, "II": 71.80, "III": 79.50,
                         "I(ю)": 93.50, "II(ю)": 113.50, "III(ю)": 132.50},
            "200м в/с": {"МС": 124.25, "КМС": 132.55, "I": 141.25, "II": 157.00, "III": 175.00,
                         "I(ю)": 206.00, "II(ю)": 246.00, "III(ю)": 284.00},
            "400м в/с": {"МС": 263.00, "КМС": 278.00, "I": 296.00, "II": 337.00, "III": 381.00,
                         "I(ю)": 452.00, "II(ю)": 523.00, "III(ю)": 594.00},
            "800м в/с": {"МС": 540.00, "КМС": 574.00, "I": 615.00, "II": 706.00, "III": 799.00,
                         "I(ю)": 964.00, "II(ю)": 1114.00, "III(ю)": 1264.00},
            "1500м в/с": {"МС": 1042.50, "КМС": 1111.50, "I": 1214.50, "II": 1364.50, "III": 1567.50,
                          "I(ю)": 1815.00, "II(ю)": 2060.00, "III(ю)": 2310.00},
            "50м на спине": {"МС": 28.85, "КМС": 30.05, "I": 31.75, "II": 36.75, "III": 40.75,
                             "I(ю)": 47.25, "II(ю)": 57.25, "III(ю)": 67.25},
            "100м на спине": {"МС": 64.00, "КМС": 68.90, "I": 73.40, "II": 81.50, "III": 91.50,
                              "I(ю)": 105.50, "II(ю)": 128.50, "III(ю)": 148.50},
            "200м на спине": {"МС": 138.75, "КМС": 146.75, "I": 155.75, "II": 175.00, "III": 197.00,
                              "I(ю)": 231.00, "II(ю)": 276.00, "III(ю)": 316.00},
            "50м брасс": {"МС": 32.65, "КМС": 34.45, "I": 36.15, "II": 40.25, "III": 44.25,
                          "I(ю)": 51.75, "II(ю)": 61.75, "III(ю)": 71.75},
            "100м брасс": {"МС": 72.40, "КМС": 76.40, "I": 81.40, "II": 90.00, "III": 102.00,
                           "I(ю)": 126.50, "II(ю)": 136.50, "III(ю)": 157.50},
            "200м брасс": {"МС": 155.25, "КМС": 164.25, "I": 174.75, "II": 195.00, "III": 220.00,
                           "I(ю)": 257.00, "II(ю)": 292.00, "III(ю)": 334.00},
            "50м батт.": {"МС": 27.50, "КМС": 28.65, "I": 31.15, "II": 33.75, "III": 36.75,
                          "I(ю)": 43.75, "II(ю)": 53.75, "III(ю)": 63.75},
            "100м батт.": {"МС": 61.90, "КМС": 65.40, "I": 69.90, "II": 79.50, "III": 90.50,
                           "I(ю)": 102.50, "II(ю)": 121.50, "III(ю)": 141.50},
            "200м батт.": {"МС": 137.75, "КМС": 145.25, "I": 155.25, "II": 176.00, "III": 199.00,
                           "I(ю)": 226.00, "II(ю)": 262.00, "III(ю)": 302.00},
            "100м комплекс": {"МС": 64.90, "КМС": 69.90, "I": 74.90, "II": 84.00, "III": 95.00,
                              "I(ю)": 107.00, "II(ю)": 126.00, "III(ю)": 166.00},
            "200м комплекс": {"МС": 141.75, "КМС": 150.25, "I": 159.75, "II": 180.00, "III": 206.00,
                              "I(ю)": 235.00, "II(ю)": 271.00, "III(ю)": 311.00},
            "400м комплекс": {"МС": 301.00, "КМС": 318.50, "I": 340.00, "II": 384.00, "III": 257.00,
                              "I(ю)": 498.00, "II(ю)": 569.00, "III(ю)": 640.00},
            "200м в/с кл.ласты": {"КМС": 117.00, "I": 127.30, "II": 136.30, "III": 148.00,
                                  "I(ю)": 164.00, "II(ю)": 178.50, "III(ю)": 192.00},
            "100м в/с кл.ласты": {"КМС": 53.30, "I": 57.30, "II": 61.90, "III": 67.8,
                                  "I(ю)": 73.50, "II(ю)": 79.60, "III(ю)": 86.00},
            "50м в/с кл.ласты": {"КМС": 24.60, "I": 26.40, "II": 28.00, "III": 30.50,
                                 "I(ю)": 33.50, "II(ю)": 36.70, "III(ю)": 39.80},
        },
        "50м": {
            "50м в/с": {"МС": 26.70, "КМС": 27.50, "I": 28.80, "II": 31.50, "III": 33.50,
                        "I(ю)": 40.50, "II(ю)": 50.50, "III(ю)": 60.00},
            "100м в/с": {"МС": 57.90, "КМС": 61.90, "I": 65.74, "II": 73.30, "III": 81.00,
                         "I(ю)": 95.00, "II(ю)": 115.00, "III(ю)": 134.00},
            "200м в/с": {},
            "400м в/с": {},
            "800м в/с": {"МС": 552.00, "КМС": 586.00, "I": 627.00, "II": 718.00, "III": 811.00,
                         "I(ю)": 976.00, "II(ю)": 1126.00, "III(ю)": 1276.00},
            "1500м в/с": {},
            "50м на спине": {"МС": 29.20, "КМС": 30.90, "I": 32.50, "II": 37.50, "III": 41.50,
                             "I(ю)": 48.00, "II(ю)": 58.00, "III(ю)": 68.00},
            "100м на спине": {"МС": 66.40, "КМС": 70.40, "I": 74.90, "II": 83.00, "III": 93.00,
                              "I(ю)": 107.00, "II(ю)": 130.00, "III(ю)": 150.00},
            "200м на спине": {},
            "50м брасс": {"МС": 33.40, "КМС": 35.20, "I": 36.90, "II": 41.00, "III": 45.00,
                          "I(ю)": 52.50, "II(ю)": 62.50, "III(ю)": 72.50},
            "100м брасс": {"МС": 73.90, "КМС": 77.90, "I": 82.90, "II": 91.50, "III": 103.50,
                           "I(ю)": 128.00, "II(ю)": 138.00, "III(ю)": 159.00},
            "200м брасс": {},
            "50м батт.": {"МС": 28.25, "КМС": 29.40, "I": 31.90, "II": 34.50, "III": 37.50,
                          "I(ю)": 44.50, "II(ю)": 54.50, "III(ю)": 64.50},
            "100м батт.": {"МС": 63.40, "КМС": 66.90, "I": 71.40, "II": 81.00, "III": 92.00,
                           "I(ю)": 104.00, "II(ю)": 123.00, "III(ю)": 143.00},
            "200м батт.": {},
            "200м комплекс": {},
            "400м комплекс": {},
        }
    },
    # МУЖЧИНЫ
    "м": {
        "25м": {
            "50м в/с": {"МС": 22.65, "КМС": 23.40, "I": 24.65, "II": 27.05, "III": 29.25,
                        "I(ю)": 35.25, "II(ю)": 45.25, "III(ю)": 55.25},
            "100м в/с": {"МС": 50.40, "КМС": 53.70, "I": 57.10, "II": 63.50, "III": 71.00,
                         "I(ю)": 83.50, "II(ю)": 103.50, "III(ю)": 123.50},
            "200м в/с": {"МС": 111.75, "КМС": 118.25, "I": 126.50, "II": 141.00, "III": 159.50,
                         "I(ю)": 185.00, "II(ю)": 195.00, "III(ю)": 265.00},
            "400м в/с": {"МС": 239.00, "КМС": 251.50, "I": 268.00, "II": 303.00, "III": 344.00,
                         "I(ю)": 400.00, "II(ю)": 456.00, "III(ю)": 512.00},
            "50м на спине": {"МС": 26.00, "КМС": 27.55, "I": 29.35, "II": 32.25, "III": 35.75,
                             "I(ю)": 41.75, "II(ю)": 51.75, "III(ю)": 61.75},
            "100м на спине": {"МС": 57.40, "КМС": 60.80, "I": 64.80, "II": 73.00, "III": 81.50,
                              "I(ю)": 94.00, "II(ю)": 116.50, "III(ю)": 136.50},
            "200м на спине": {},
            "50м брасс": {"МС": 28.45, "КМС": 30.00, "I": 31.85, "II": 35.25, "III": 38.75,
                          "I(ю)": 45.25, "II(ю)": 55.25, "III(ю)": 65.25},
            "100м брасс": {"МС": 63.40, "КМС": 67.30, "I": 71.80, "II": 80.50, "III": 88.50,
                           "I(ю)": 104.50, "II(ю)": 123.50, "III(ю)": 143.50},
            "200м брасс": {},
            "50м батт.": {"МС": 24.15, "КМС": 25.15, "I": 27.15, "II": 30.25, "III": 33.25,
                          "I(ю)": 38.25, "II(ю)": 48.25, "III(ю)": 58.25},
            "100м батт.": {"МС": 54.40, "КМС": 58.40, "I": 61.90, "II": 70.50, "III": 80.50,
                           "I(ю)": 90.50, "II(ю)": 109.50, "III(ю)": 129.50},
            "200м батт.": {},
            "100м комплекс": {"МС": 56.90, "КМС": 61.90, "I": 65.90, "II": 74.00, "III": 84.00,
                              "I(ю)": 95.00, "II(ю)": 114.00, "III(ю)": 134.00},
            "200м комплекс": {"МС": 126.75, "КМС": 134.25, "I": 142.75, "II": 161.00, "III": 185.00,
                              "I(ю)": 210.00, "II(ю)": 245.00, "III(ю)": 285.00},
            "400м комплекс": {},
            "200м в/с кл.ласты": {"КМС": 105.80, "I": 114.60, "II": 123.80, "III": 134.60,
                                  "I(ю)": 148.50, "II(ю)": 162.00, "III(ю)": 175.00},
            "100м в/с кл.ласты": {"КМС": 47.30, "I": 50.80, "II": 55.90, "III": 60.4,
                                  "I(ю)": 66.00, "II(ю)": 72.00, "III(ю)": 78.50},
            "50м в/с кл.ласты": {"КМС": 21.30, "I": 23.00, "II": 24.80, "III": 26.50,
                                 "I(ю)": 29.80, "II(ю)": 32.40, "III(ю)": 35.50},
        },
        "50м": {
            "50м в/с": {"МС": 23.40, "КМС": 24.15, "I": 25.40, "II": 27.80, "III": 30.00,
                        "I(ю)": 36.00, "II(ю)": 46.00, "III(ю)": 56.00},
            "100м в/с": {"МС": 51.90, "КМС": 55.30, "I": 58.70, "II": 65.00, "III": 72.50,
                         "I(ю)": 85.00, "II(ю)": 105.00, "III(ю)": 125.00},
            "200м в/с": {},
            "400м в/с": {},
            "50м на спине": {"МС": 26.85, "КМС": 28.35, "I": 30.15, "II": 33.00, "III": 36.50,
                             "I(ю)": 42.50, "II(ю)": 52.50, "III(ю)": 62.50},
            "100м на спине": {"МС": 58.90, "КМС": 62.40, "I": 66.40, "II": 74.50, "III": 83.00,
                              "I(ю)": 95.50, "II(ю)": 118.00, "III(ю)": 138.00},
            "200м на спине": {},
            "50м брасс": {"МС": 29.20, "КМС": 30.70, "I": 32.60, "II": 36.00, "III": 39.50,
                          "I(ю)": 46.00, "II(ю)": 56.00, "III(ю)": 66.00},
            "100м брасс": {"МС": 64.90, "КМС": 68.90, "I": 73.40, "II": 88.00, "III": 90.00,
                           "I(ю)": 106.00, "II(ю)": 125.00, "III(ю)": 145.00},
            "200м брасс": {},
            "50м батт.": {"МС": 24.90, "КМС": 25.90, "I": 27.90, "II": 31.00, "III": 34.00,
                          "I(ю)": 39.00, "II(ю)": 49.00, "III(ю)": 59.00},
            "100м батт.": {"МС": 55.90, "КМС": 59.90, "I": 63.40, "II": 72.00, "III": 82.00,
                           "I(ю)": 92.00, "II(ю)": 111.00, "III(ю)": 131.00},
            "200м батт.": {},
            "200м комплекс": {},
            "400м комплекс": {},
        }
    }
}

fina_basetime = {'ж': {'50м в/с': {'25м': 22.93, '50м': 23.67},
                       '100м в/с': {'25м': 50.25, '50м': 51.71},
                       '200м в/с': {'25м': 110.43, '50м': 112.98},
                       '400м в/с': {'25м': 233.92, '50м': 236.46},
                       '800м в/с': {'25м': 479.34, '50м': 484.79},
                       '1500м в/с': {'25м': 918.01, '50м': 920.48},
                       '50м на спине': {'25м': 25.60, '50м': 26.98},
                       '100м на спине': {'25м': 54.89, '50м': 57.45},
                       '200м на спине': {'25м': 118.94, '50м': 123.35},
                       '50м брасс': {'25м': 28.56, '50м': 29.30},
                       '100м брасс': {'25м': 62.36, '50м': 64.13},
                       '200м брасс': {'25м': 134.57, '50м': 138.95},
                       '50м батт.': {'25м': 24.38, '50м': 24.43},
                       '100м батт.': {'25м': 54.61, '50м': 55.48},
                       '200м батт.': {'25м': 119.61, '50м': 121.81},
                       '100м комплекс': {'25м': 56.51},
                       '200м комплекс': {'25м': 121.86, '50м': 126.12},
                       '400м комплекс': {'25м': 258.94, '50м': 266.36},
                       '25м в/с': {'25м': 10.46},
                       '25м на спине': {'25м': 11.88},
                       '25м брасс': {'25м': 13.28},
                       '25м батт.': {'25м': 11.19}
                       },
                 'м': {'50м в/с': {'25м': 20.16, '50м': 20.91},
                       '100м в/с': {'25м': 44.94, '50м': 46.91},
                       '200м в/с': {'25м': 99.37, '50м': 102.00},
                       '400м в/с': {'25м': 212.25, '50м': 220.07},
                       '800м в/с': {'25м': 443.42, '50м': 452.12},
                       '1500м в/с': {'25м': 848.06, '50м': 871.02},
                       '50м на спине': {'25м': 22.22, '50м': 23.80},
                       '100м на спине': {'25м': 48.33, '50м': 51.85},
                       '200м на спине': {'25м': 105.63, '50м': 111.92},
                       '50м брасс': {'25м': 25.25, '50м': 25.95},
                       '100м брасс': {'25м': 55.34, '50м': 56.88},
                       '200м брасс': {'25м': 120.16, '50м': 126.12},
                       '50м батт.': {'25м': 21.75, '50м': 22.27},
                       '100м батт.': {'25м': 47.78, '50м': 49.45},
                       '200м батт.': {'25м': 108.24, '50м': 110.73},
                       '100м комплекс': {'25м': 49.28},
                       '200м комплекс': {'25м': 109.63, '50м': 114.00},
                       '400м комплекс': {'25м': 234.81, '50м': 243.84},
                       '25м в/с': {'25м': 9.08},
                       '25м на спине': {'25м': 10.36},
                       '25м брасс': {'25м': 11.47},
                       '25м батт.': {'25м': 9.87}
                       }
                 }


def fina_points(gender, swimming_pool, distance, swimmer_time):
    if 'ласты' in distance:
        distance = distance[:-9]
    # if distance.startswith("25"):
    #     return 0
    base_time = fina_basetime[gender][distance][swimming_pool]
    if swimmer_time is not None and swimmer_time != 0:
        points = 1000 * (base_time / swimmer_time) ** 3
        if swimmer_time == 9999.0:
            points = 0
        return int(points)
    else:
        return 0


def sport_category(gender, swimming_pool, distance, time):
    if distance.startswith("25"):
        return ""
    distance_time = categories[gender][swimming_pool][distance]
    for cat, time_ in distance_time.items():
        if time is not None and time_ >= time:
            return cat


time_swimmer = 42.87
# print(sport_category('м', '50м', '100м в/с', time_swimmer), time_swimmer)
print(fina_points('ж', '25м', '25м в/с', time_swimmer))

# times_swimmer = (123.70, 97.87, 99.91, 101.74, 111.40, 114.66, 116.68, 118.10, 120.41, 121.79)

# for t_ in times_swimmer:
#     print(fina_points('ж', '25м', '100м батт.', t_))

# def time_to_time(tt):
#     minute = int(tt[0])
#     secunde = int(tt[2] + tt[3])
#     milis = int(tt[5] + tt[6])
#     time_ = minute*60 + secunde + milis/100
#     # print(time_)
#     print(fina_points('ж', '25м', '100м батт.', time_))
#
# times = ('1.35,74', '1.37,86','1.41,52')
























# for t in times:
#     time_to_time(t)





# def tet(tim_):
#     m = tim_ // 6000
#     s = (tim_ % 6000) / 100
#     if m > 0:
#         str_ = f'{tim_ // 6000}:{(tim_ % 6000) / 100:05.2f}'
#     else:
#         str_ = f'{((tim_ % 6000) / 100):05.2f}'
#     return str_
#
# tim_ = 13811
# print(tet(tim_))
#
#
# mm = 10
# ss = 10
# ms = 10
#
# entry_time = (mm * 60 + ss) * 100 + ms
#
# print(entry_time)
# print(tet(entry_time))

# names = ['Стемасов', 'Чернов', 'Сидоров', 'Бурлаков']
# spina = [220, 265, 229, 195]
# brass = [163, 192, 180, 192]
# batt = [174, 268, 100, 205]
# vs = [232, 275, 244, 201]

# names = ['Исаева', 'Поспехова', 'Шангина', 'Мазаева']
# spina = [204, 203, 212, 211]
# brass = [219, 152, 109, 181]
# batt = [160, 89, 110, 171]
# vs = [225, 192, 204, 289]
#
#
# def boys():
#     bb = {}
#     for n_sp, sp in enumerate(spina):
#         for n_br, br in enumerate(brass):
#             for n_ba, ba in enumerate(batt):
#                 for n_v, v in enumerate(vs):
#                     if n_sp != n_br and n_sp != n_ba and n_sp != n_v and n_br != n_ba and n_br != n_v and n_ba != n_v:
#                         bb[sp + br + ba + v] = names[n_sp], names[n_br], names[n_ba], names[n_v]
#                         print(sp + br + ba + v, names[n_sp], names[n_br], names[n_ba], names[n_v])
# #
#     print(bb)
#     ss = []
#     for key, value in bb.items():
#         ss.append(key)
#     ss.sort(reverse=True)
#     print(f"{ss[0]} - {bb[ss[0]]}\n{ss[1]} - {bb[ss[1]]}\n{ss[2]} - {bb[ss[2]]}")
# boys()
